[
  "If you could design a planet, what would your perfect planet look like?",
  "If you could be any animal, what would you be and why?",
  "If you could be any fictional character, who would you choose and why?",
  "If you were chosen to be the first human to make contact with aliens, would you want to?",
  "Would you choose to know your future if it meant forgetting your past?",
  "If you could design and bring into the world one new creature, what animal would you create?",
  "If you were a transformer, what vehicle would you turn into?",
  "If you could have any superpower, what would it be and why?",
  "If your dog or cat suddenly spoke one sentence and then never spoke again, what would be the most unsettling sentence they could say?",
  "What would you do with a real bag of holding?",
  "If you could have a conversation with any one person, alive or dead, who would you choose?",
  "If you had a handful of modeling clay and whatever you made would become real, what would you create?",
  "What two animals would you like to switch the sounds they make?",
  "If you could have any animal as a pet, what animal would you choose?",
  "What amusement park ride do you wish existed?",
  "What amusement park do you wish existed?",
  "If you could change what people say after someone sneezes, what would you make them say?",
  "If you could create a new animal by combining two existing animals, what would you create?",
  "If you could create a new holiday, what would it be?",
  "If you could create a new mode of transportation that is widely used, no matter how ridiculous, what would you create?",
  "Choose one superpower: learn the history of any object you touch, or be able to talk to animals.",
  "If you could add a new never-before-seen color to the spectrum, what would you call it?",
  "If you could switch places with any person for a day, who would you choose and why?",
  "If you were a ghost and had to pick a place to haunt for the rest of eternity, where would you choose?",
  "If you could put a new word into the dictionary, what would it be and what is its definition?",
  "If you had to pick three meals (breakfast, lunch, and dinner) to eat for the rest of your life, what would they be?",
  "If you could instantly know the truth behind any single secret or mystery, what would it be?",
  "Who would win: a dragon or a unicorn?",
  "Who would win: a puppy-sized dragon or a dragon-sized puppy?",
  "If a new restaurant opened up tailored specifically to your tastes, what would be on the menu?",
  "If you had to join the circus, what would your act be?",
  "If you could call yourself a year ago and had 30 seconds, what would you say?",
  "If you could call yourself 10 years from now and had 30 seconds, what would you say?",
  "If you could create a clone of your consciousness that would live forever, but you wouldn't, would you do it?",
  "If you could create a pocket dimension the size of a football field that you could travel to any time you wanted, what would it be like?",
  "If you could control your dreams, what would you dream about?",
  "If you had to pick a single song to play every time you walked into a room for the rest of your life, what would it be?",
  "If you could have any one item from any video game, what would you choose?",
  "If you had to pick a single season for the earth to be stuck in for the rest of eternity, which would you choose?",
  "What animal would be way cooler if it was covered in scales?",
  "If you could choose one element (earth, air, fire, water) to control, which would you choose?",
  "What do you wish grew on trees (besides money)?",
  "If you could snap your fingers and instantly make the world better at one thing, what would it be?",
  "If you could put wings on any species of animal, which would you choose?",
  "How would the world change if there was no internal monologue, and everyone verbalized their every thought?",
  "What animal would be way cuter if it was the size of a cat?",
  "If you had to choose between either all your furniture coming to life every night or all your food coming to life every night, which would you choose?",
  "If you could become three times bigger or fifty times smaller at will, which do you think you would spend more time as, big you or small you? Why?",
  "If you had to become an NPC in any videogame, which game would you choose to reside in?",
  "If you could choose any single cartoon to merge with reality, which would you choose?",
  "If you could choose any single movie to merge with reality, which would you choose?",
  "If you could swap the tastes of any two foods, which would you choose?",
  "If you could swap the smells of any two things, which would you choose?",
  "If you could swap the colors of any two things, which would you choose?",
  "If you could choose to become an immortal spirit and travel the universe at will, but you would never be able to interact with the physical world again, would you do it?",
  "Which would you rather encounter: a friendly ghost or a friendly alien?",
  "If you could become the world-leading expert in any one thing, what would you choose?",
  "If you could make everyone on earth a master at one skill, what would you choose?",
  "Would you accept a million dollars if it meant that every time you spent money, you would have to spend it on something you didn't want?",
  "If the zombie apocalypse happened tomorrow, what would be your plan?",
  "If you could have any one weapon during the zombie apocalypse, what would you choose?",
  "If you could choose any fictional character to have by your side during the zombie apocalypse, who would you choose?",
  "If you had to see the world in shades of one color, which would you choose?",
  "If it was octopus instead of humans that had become the dominant species on earth, what would the world be like?",
  "If you never had to sleep again, what would you do with the extra time?",
  "If the universe was reset to where it was 5000 years ago, do you think events would play out the same way and eventually lead to the same world we have today?",
  "If you could choose to lose one of your five senses, and have another one become superhuman, which would you choose?",
  "What's the most useless superpower you can think of?",
  "Waffles or pancakes?",
  "Should pizza be cut into squares or triangles?",
  "What are you surprised hasn't been invented yet?",
  "What five objects that you can fit in a backpack would you bring to a desert island?",
  "If you had to choose between being able to fly or being able to breathe underwater, which would you choose?",
  "If you could only keep five apps on your phone, which would you choose?",
  "If your pet suddenly could talk, what would be the first thing they would say?",
  "If magic was real, what spell would you try to learn first?",
  "What game do you wish you could play again for the first time?",
  "What game do you wish existed?",
  "What is the most useless fact you know?",
  "If you could pick up any hobby, no matter how expensive, eccentric, or difficult, what would you choose?",
  "If you could instantly have the answer to one question, what would you ask?",
  "What's the spiciest thing you've ever eaten?",
  "What's the most ridiculous thing you own?",
  "Would you rather be a super fast typer or a super fast reader?",
  "Would you rather play a game with bad mechanics but great story or great mechanics but no story?",
  "Would you rather speak all human languages or be able to talk to animals?",
  "Would you rather be an NPC in a boring but peaceful game or the hero in a game full of danger and conflict?",
  "Would you rather have unlimited storage space on your computer or an unending supply of your favorite snack while coding?",
  "If you could create a brand new programming language, what would the syntax be like?",
  "Would you rather only be able to code with randomly named functions or have all your code comments be nonsensical riddles?",
  "Would you rather fight one horse-sized duck or one hundred duck-sized horses?",
  "Would you rather have the ability to teleport anywhere or to be able to read minds?",
  "Would you rather have to shout everything you say or whisper everything you say?",
  "Would you rather always have to enter rooms by announcing your name or always have to do a cartwheel in?",
  "Would you rather have robotic arms or robotic legs?",
  "Would you rather be able to use only one programming language forever or use a different programming language every month?",
  "Would you rather be able to instantly learn any programming language or instantly understand any algorithm?",
  "Would you rather live in a world where it rains your favorite snack or where it rains your favorite drink?",
  "Would you rather have your life narrated by a professional esports commentator or by a laid-back Let's Play YouTuber?",
  "Would you rather only be able to communicate in TV/Movie quotes or song lyrics?"
]