[
  {
    "riddle": "Almost everyone needs it, asks for it, gives it. But almost nobody takes it.",
    "answer": "advice"
  },
  {
    "riddle": "What goes up but never comes down?",
    "answer": "age"
  },
  {
    "riddle": "Die without me, never thank me. Walk right through me, never feel me. Always watching, never speaking. Always lurking, never seen.",
    "answer": "air"
  },
  {
    "riddle": "I cost no money to use, or conscious effort to take part of. And as far as you can see, there is nothing to me. But without me, you are dead.",
    "answer": "air"
  },
  {
    "riddle": "Come up and let us go. Go down and here we stay.",
    "answer": "anchor"
  },
  {
    "riddle": "What do you throw out to use and take in when you're done?",
    "answer": "anchor"
  },
  {
    "riddle": "I fly through the air on small feathered wings, seeking out life and destroying all things.",
    "answer": "arrow"
  },
  {
    "riddle": "I have many feathers to help me fly. I have a body and head, but I'm not alive. It is your strength which determines how far I go. You can hold me in your hand, but I'm never thrown.",
    "answer": "arrow"
  },
  {
    "riddle": "I can be moved. I can be rolled. But nothing will I hold. I'm red and I'm blue, and I can be other colors too. Having no head, though similar in shape. I have no eyes - yet move all over the place.",
    "answer": "ball"
  },
  {
    "riddle": "A time when they're green. A time when they're brown. But both of these times, cause me to frown. But just in between, for a very short while. They're perfect and yellow. And cause me to smile.",
    "answer": "bananas"
  },
  {
    "riddle": "My first is in blood and also in battle. My second is in acorn, oak, and apple. My third and fourth are both the same. In the center of sorrow and twice in refrain. My fifth starts eternity ending here. My last is the first of last, Oh Dear.",
    "answer": "barrel"
  },
  {
    "riddle": "I sleep by day, I fly by night. I have no feathers to aid my flight.",
    "answer": "bat"
  },
  {
    "riddle": "When I’m metal or wood, I help you get home. When I’m flesh and I’m blood, In the darkness I roam.",
    "answer": "bat"
  },
  {
    "riddle": "I am the yellow hem of the sea's blue skirt.",
    "answer": "beach"
  },
  {
    "riddle": "In the night a mountain, in the morning a meadow.",
    "answer": "bed"
  },
  {
    "riddle": "What is it that has four legs, one head, and a foot?",
    "answer": "bed"
  },
  {
    "riddle": "A warrior amongst the flowers, he bears a thrusting sword. He uses it whenever he must, to defend his golden hoard.",
    "answer": "bee"
  },
  {
    "riddle": "Thousands lay up gold within this house. But no man made it. Spears past counting guard this house, but no man wards it.",
    "answer": "beehive"
  },
  {
    "riddle": "Round as a button, deep as a well. If you want me to talk, you must first pull my tail.",
    "answer": "bell"
  },
  {
    "riddle": "You heard it speak, for it has a hard tongue. But it cannot breathe, for it has not a lung.",
    "answer": "bell"
  },
  {
    "riddle": "I am a fire's best friend. When fat, my body fills with wind. When pushed to thin, through my nose I blow. Then you can watch the embers glow.",
    "answer": "bellows"
  },
  {
    "riddle": "You get many of me, but never enough. After the last one, your life soon will snuff. You may have one of me but one day a year, When the last one is gone, your life disappears.",
    "answer": "birthday"
  },
  {
    "riddle": "I am seen in the water. If seen in the sky, I am in the rainbow, a jay's feather, and lapis lazuli.",
    "answer": "blue"
  },
  {
    "riddle": "My life is often a volume of grief, your help is needed to turn a new leaf. Stiff is my spine and my body is pale. But I'm always ready to tell a tale.",
    "answer": "book"
  },
  {
    "riddle": "Turns us on our backs, and open our stomachs. You will be the wisest of men though at start a lummox.",
    "answer": "books"
  },
  {
    "riddle": "Two brothers we are, great burdens we bear. All day we are bitterly pressed. Yet this I will say, we are full all the day, and empty when go to rest.",
    "answer": "boots"
  },
  {
    "riddle": "I have a neck but no head. I have a body but no arm. I have a bottom but no leg.",
    "answer": "bottle"
  },
  {
    "riddle": "As light as a feather, but you can’t hold it for ten minutes.",
    "answer": "breath"
  },
  {
    "riddle": "Hard to catch, easy to hold. Can't be seen, unless it's cold.",
    "answer": "breath"
  },
  {
    "riddle": "I am free for the taking. Through all of your life, though given but once at birth. I am less than nothing in weight, but will fell the strongest of you if held.",
    "answer": "breath"
  },
  {
    "riddle": "I'm light as a feather, yet the strongest human can't hold me for more than 5 minutes.",
    "answer": "breath"
  },
  {
    "riddle": "To cross the water I'm the way, for water I'm above. I touch it not and, truth to say, I neither swim nor move.",
    "answer": "bridge"
  },
  {
    "riddle": "All about the house, with his lady he dances, yet he always works, and never romances.",
    "answer": "broom"
  },
  {
    "riddle": "I have a hundred legs, but cannot stand. I have a long neck, but no head. I cannot see. I'm neat and tidy as can be.",
    "answer": "broom"
  },
  {
    "riddle": "A muttered rumble was heard from the pen, and I, in my walking stopped to look in. What was this I saw? A massive beast, hoofed, and jawed. With spikes upon its mighty brow, I watched as he struck the turf and prowled. And yet for all of his magnificence, he couldn't get out of that wooden fence.",
    "answer": "bull"
  },
  {
    "riddle": "What lies in a tunnel of darkness. That can only attack when pulled back?",
    "answer": "bullet"
  },
  {
    "riddle": "Flat as a leaf, round as a ring. Has two eyes, can't see a thing.",
    "answer": "button"
  },
  {
    "riddle": "No matter how little or how much you use me, you change me every month.",
    "answer": "calendar"
  },
  {
    "riddle": "I have one eye. See near and far. I hold the moments you treasure and the things that make you weep.",
    "answer": "camera"
  },
  {
    "riddle": "Always wax, yet always wane: I melt, succumbed to the flame. Lighting darkness, with fate unblest, I soon devolve to shapeless mess.",
    "answer": "candle"
  },
  {
    "riddle": "My life can be measured in hours. I serve by being devoured. Thin, I am quick. Fat, I am slow. Wind is my foe.",
    "answer": "candle"
  },
  {
    "riddle": "What has 13 hearts but none beat?",
    "answer": "cards"
  },
  {
    "riddle": "What has hands but can not clap?",
    "answer": "clock"
  },
  {
    "riddle": "What has many ears but can't hear a thing?",
    "answer": "cornfield"
  },
  {
    "riddle": "What kind of pet always stays on the floor?",
    "answer": "carpet"
  },
  {
    "riddle": "Halo of water, tongue of wood. Skin of stone, long I've stood. My fingers short reach to the sky. Inside my heart men live and die.",
    "answer": "castle"
  },
  {
    "riddle": "Stealthy as a shadow in the dead of night, cunning but affectionate if given a bite. Never owned but often loved. At my sport considered cruel, but that's because you never know me at all.",
    "answer": "cat"
  },
  {
    "riddle": "Though desert men once called me God, today men call me mad. For I wag my tail when I am angry. And growl when I am glad.",
    "answer": "cat"
  },
  {
    "riddle": "I'm not really more than holes tied to more holes. I'm strong as good steel, though not as stiff as a pole.",
    "answer": "chain"
  },
  {
    "riddle": "I have legs but walk not, a strong back but work not. Two good arms but reach not. A seat but sit and tarry not.",
    "answer": "chair"
  },
  {
    "riddle": "What's black when you get it, red when you use it, and white when you're all through with it?",
    "answer": "charcoal"
  },
  {
    "riddle": "Not born, but from a Mother's body drawn. I hang until half of me is gone. I sleep in a cave until I grow old. Then valued for my hardened gold.",
    "answer": "cheese"
  },
  {
    "riddle": "I wear a red robe, with staff in hand, and a stone in my throat.",
    "answer": "cherry"
  },
  {
    "riddle": "A slow, solemn square-dance of warriors feinting. One by one they fall, warriors fainting, thirty-two on sixty-four.",
    "answer": "chess"
  },
  {
    "riddle": "What is it that given one, you’ll have either two or none?",
    "answer": "choice"
  },
  {
    "riddle": "I have a face, yet no senses. But I don't really care, because time is of the essence.",
    "answer": "clock"
  },
  {
    "riddle": "This thing runs but cannot walk, sometimes sings but never talks. Lacks arms, has hands; lacks a head but has a face.",
    "answer": "clock"
  },
  {
    "riddle": "I fly, yet I have no wings. I cry, yet I have no eyes. Darkness follows me. Lower light I never see.",
    "answer": "cloud"
  },
  {
    "riddle": "Black we are and much admired. Many seek us if they are tired. We tire the horse, and comfort man, and turn White when we've fulfilled your plan.",
    "answer": "coal"
  },
  {
    "riddle": "What’s black in the morning, red in the afternoon, and white at night?",
    "answer": "coal"
  },
  {
    "riddle": "A little pool with two layers of wall around it. One white and soft and the other dark and hard. Amidst a light brown grassy lawn with an outline of a green grass.",
    "answer": "coconut"
  },
  {
    "riddle": "The one who made it didn't need it. The one who bought it didn't use it. The one who used it didn't want it.",
    "answer": "coffin"
  },
  {
    "riddle": "The one who makes it, sells it. The one who buys it, never uses it. The one that uses it never knows that he’s using it.",
    "answer": "coffin"
  },
  {
    "riddle": "I am two-faced but bear only one. I have no legs but travel widely. Men spill much blood over me. Kings leave their imprint on me. I have greatest power when given away, yet lust for me keeps me locked away.",
    "answer": "coin"
  },
  {
    "riddle": "What can you catch but not throw?",
    "answer": "cold"
  },
  {
    "riddle": "Metal or bone I may be, many teeth I have and always bared. Yet my bite harms no one. And ladies delight in my touch.",
    "answer": "comb"
  },
  {
    "riddle": "I am so simple that I can only point. Yet I guide men all over the world.",
    "answer": "compass"
  },
  {
    "riddle": "You throw away the outside and cook the inside. Then you eat the outside and throw away the inside. What did you eat?",
    "answer": "corn"
  },
  {
    "riddle": "Whoever makes it, tells it not. Whoever takes it, knows it not. Whoever knows it, wants it not",
    "answer": "counterfeit"
  },
  {
    "riddle": "The more of it there is, the less you see.",
    "answer": "darkness"
  },
  {
    "riddle": "Five hundred begins it, five hundred ends it. Five in the middle is seen. First of all figures, the first of all letters. Take up their stations between. Join all together, and then you will bring before you the name of an eminent king.",
    "answer": "david"
  },
  {
    "riddle": "Some try to hide, some try to cheat. But time will show, we always will meet. Try as you might, to guess my name. I promise you'll know, when you I do claim.",
    "answer": "death"
  },
  {
    "riddle": "What begins and has no end? What is the ending of all that begins?",
    "answer": "death"
  },
  {
    "riddle": "What is put on a table, cut, but never eaten?",
    "answer": "deck"
  },
  {
    "riddle": "I dig out tiny caves and store gold and silver in them. I also build bridges of silver and make crowns of gold. They are the smallest you could imagine. Sooner or later everybody needs my help. Yet many people are afraid to let me help them.",
    "answer": "dentist"
  },
  {
    "riddle": "You will find me with four legs, but no hair. People ride me for hours, but I don't go anywhere without needing to be tugged. Jerked or turned on, I always manage to be ready for work.",
    "answer": "desk"
  },
  {
    "riddle": "A tiny bead, like fragile glass, strung along a cord of grass.",
    "answer": "dew"
  },
  {
    "riddle": "What has six faces and twenty-one eyes?",
    "answer": "die"
  },
  {
    "riddle": "What wears a coat in the winter and pants in the summer?",
    "answer": "dog"
  },
  {
    "riddle": "Hands she has but does not hold. Teeth she has but does not bite. Feet she has but they are cold. Eyes she has but without sight.",
    "answer": "doll"
  },
  {
    "riddle": "What kind of nut is empty at the center and has no shell.",
    "answer": "doughnut"
  },
  {
    "riddle": "My first is in window but not in pane. My second's in road but not in lane. My third is in oval but not in round. My fourth is in hearing but not in sound. My whole is known as a sign of peace. And from noah's ark won quick release.",
    "answer": "dove"
  },
  {
    "riddle": "A word I know, six letters it contains. Subtract just one and twelve remains.",
    "answer": "dozens"
  },
  {
    "riddle": "This is in a realm of true and in a realm false, but you experience me as you turn and toss.",
    "answer": "dream"
  },
  {
    "riddle": "People are hired to get rid of me. I'm often hiding under your bed. In time I'll always return you see. Bite me and you're surely dead.",
    "answer": "dust"
  },
  {
    "riddle": "I am the third from a sparkle bright, I thrive throughout the day and night. Deep in the path of a cow's white drink. I've had thousands of millions of years to think. What am I?",
    "answer": "earth"
  },
  {
    "riddle": "You heard me before, yet you hear me again. Then I die, 'till you call me again.",
    "answer": "echo"
  },
  {
    "riddle": "A box without hinges, lock or key, yet golden treasure lies within.",
    "answer": "egg"
  },
  {
    "riddle": "In marble halls as white as milk, lined with a skin as soft as silk. Within a fountain crystal-clear. A golden apple doth appear. No doors there are to this stronghold, yet thieves break in and steal the gold.",
    "answer": "egg"
  },
  {
    "riddle": "What has to be broken before it can be used?",
    "answer": "egg"
  },
  {
    "riddle": "Face with a tree, skin like the sea. A great beast I am. Yet vermin frightens me.",
    "answer": "elephant"
  },
  {
    "riddle": "What word starts with 'E', ends with 'E', but only has one letter? It is not the letter 'E'.",
    "answer": "envelope"
  },
  {
    "riddle": "A hole in a pole, though I fill a hole in white. I'm used more by the day, and less by the night.",
    "answer": "eye"
  },
  {
    "riddle": "What is pronounced like one letter, written with three letters. And belongs to all animals?",
    "answer": "eye"
  },
  {
    "riddle": "Two horses, swiftest traveling, harnessed in a pair, and grazing ever in places. Distant from them.",
    "answer": "eyes"
  },
  {
    "riddle": "It's in your hand though you can not feel it. Only you and time can reveal it.",
    "answer": "fate"
  },
  {
    "riddle": "I sneak up on you in the still of the night. I turn the brave heart weak, chilling your soul with fright. Safety I promise, yet I bind you tight. In trembling hands and cold sweat, you feel my might. I am the uninvited guest to the bold's respite.",
    "answer": "fear"
  },  
  {
    "riddle": "I am the outstretched fingers that seize and hold the wind. Wisdom flows through me in others' hands. Upon me are sweet dreams dreamt, my slightest touch brings laughter.",
    "answer": "feather"
  },
  {
    "riddle": "I know a word of letters three. Add two, and fewer there will be!",
    "answer": "few"
  },
  {
    "riddle": "Long and thin, red within, with a nail at the end.",
    "answer": "finger"
  },
  {
    "riddle": "As destructive as life, as healing as death. A catalyst of conflict, yet a blessing no realer. It embodies goodness but can turn the trend. As it was the beginning of things, it can also be the end.",
    "answer": "fire"
  },
  {
    "riddle": "Feed me and I live, give me drink and I die.",
    "answer": "fire"
  },
  {
    "riddle": "Give it food and it will live, give it water and it will die.",
    "answer": "fire"
  },
  {
    "riddle": "I am always hungry, I must always be fed. The finger I lick will soon turn red.",
    "answer": "fire"
  },
  {
    "riddle": "Screaming, soaring seeking sky. Flowers of fire flying high. Eastern art from ancient time. Name me now and solve this rhyme.",
    "answer": "firework"
  },
  {
    "riddle": "Alive without breath, As cold as death, Clad in mail never clinking, Never thirsty, ever drinking",
    "answer": "fish"
  },
  {
    "riddle": "I march before armies, a thousand salute me. My fall can bring victory, but no one would shoot me. The wind is my lover, one-legged am I. Name me and see me at home in the sky.",
    "answer": "flag"
  },
  {
    "riddle": "Up on high I wave away but not a word can I say.",
    "answer": "flag"
  },
  {
    "riddle": "When they are caught, they are thrown away. When they escape, you itch all day.",
    "answer": "fleas"
  },
  {
    "riddle": "A thousand colored folds stretch toward the sky. Atop a tender strand, rising from the land, until killed by maiden's hand. Perhaps a token of love, perhaps to say goodbye.",
    "answer": "flower"
  },
  {
    "riddle": "Who spends the day at the window, goes to the table for meals. And hides at night?",
    "answer": "fly"
  },
  {
    "riddle": "My second is performed by my first, and it is thought a thief by the marks of my whole might be caught.",
    "answer": "footstep"
  },
  {
    "riddle": "I bubble and laugh and spit water in your face. I am no lady, and I don't wear lace.",
    "answer": "fountain"
  },
  {
    "riddle": "I have four legs but no tail. Usually I am heard only at night.",
    "answer": "frog"
  },
  {
    "riddle": "Goes over all the hills and hollows. Bites hard, but never swallows.",
    "answer": "frost"
  },
  {
    "riddle": "My first is in fish but not in snail. My second is in rabbit but not in tail. My third is in up but not in down. My fourth is in tiara but not in crown. My fifth is in tree you plainly see. My whole a food for you and me.",
    "answer": "fruit"
  },
  {
    "riddle": "My first master has four legs, my second master has two. My first I serve in life, my second I serve in death. Tough I am, yet soft beside. Against ladies cheeks I often reside.",
    "answer": "fur"
  },
  {
    "riddle": "Born of earth, but with none of its strength. Molded by flame, but with none of its power. Shaped",
    "answer": "glass"
  },
  {
    "riddle": "Without a bridle, or a saddle, across a thing I ride a-straddle. And those I ride, by help of me, though almost blind, are made to see.",
    "answer": "glasses"
  },
  {
    "riddle": "They have not flesh, nor feathers, nor scales, nor bone. Yet they have fingers and thumbs of their own.",
    "answer": "gloves"
  },
  {
    "riddle": "What do you fill with empty hands?",
    "answer": "gloves"
  },
  {
    "riddle": "When I am filled, I can point the way. When I am empty. Nothing moves me. I have two skins. One without and one within.",
    "answer": "gloves"
  },
  {
    "riddle": "I drive men mad for love of me. Easily beaten, never free.",
    "answer": "gold"
  },
  {
    "riddle": "The sun bakes them, the hand breaks them, the foot treads on them, and the mouth tastes them.",
    "answer": "grapes"
  },
  {
    "riddle": "The sharp slim blade, that cuts the wind.",
    "answer": "grass"
  },
  {
    "riddle": "So cold, damp and dark this place. To stay you would refrain, yet those who occupy this place do never complain.",
    "answer": "grave"
  },
  {
    "riddle": "They can be harbored, but few hold water. You can nurse them, but only by holding them against someone else. You can carry them, but not with your arms. You can bury them, but not in the earth.",
    "answer": "grudge"
  },
  {
    "riddle": "I have one, you have one. If you remove the first letter, a bit remains. If you remove the second, bit still remains. If you remove the third, it still remains.",
    "answer": "habit"
  },
  {
    "riddle": "Grows from the ground, bushes and grass, leaves of yellow, red and brow, unruly plants, get the axe, trim the hedge back down.",
    "answer": "hair"
  },
  {
    "riddle": "What is that over the head and under the hat?",
    "answer": "hair"
  },
  {
    "riddle": "Two in a whole and four in a pair. And six in a trio you see. And eight's a quartet but what you must get. Is the name that fits just one of me?",
    "answer": "half"
  },
  {
    "riddle": "How far will a blind dog walk into a forest?",
    "answer": "halfway"
  },
  {
    "riddle": "They are many and one, they wave and they drum, Used to cover a state, they go with you everywhere.",
    "answer": "hands"
  },
  {
    "riddle": "What do you use to hoe a row, slay a foe, and wring with woe?",
    "answer": "hands"
  },
  {
    "riddle": "Inside a burning house, this thing is best to make. And best to make it quickly, before the fire's too much to take.",
    "answer": "haste"
  },
  {
    "riddle": "You can tumble in it, roll in it, burn it, animal eat it. Used to cover floors, still used beyond stall doors. Freshens whatever it is placed on. Absorbs whatever is poured into it.",
    "answer": "hay"
  },
  {
    "riddle": "A red drum which sounds without being touched, and grows silent, when it is touched.",
    "answer": "heart"
  },
  {
    "riddle": "I'm the source of all emotion, but I'm caged in a white prison.",
    "answer": "heart"
  },
  {
    "riddle": "If you break me, I do not stop working. If you touch me, I may be snared. If you lose me, nothing will matter.",
    "answer": "heart"
  },
  {
    "riddle": "It cannot be seen, it weighs nothing, but when put into a barrel, it makes it lighter.",
    "answer": "hole"
  },
  {
    "riddle": "What can you put in a barrel to make it lighter?",
    "answer": "hole"
  },
  {
    "riddle": "What gets bigger the more you take away from it?",
    "answer": "hole"
  },
  {
    "riddle": "When you stop and look, you can always see me. If you try to touch, you cannot feel me. I cannot move, but as you near me, I will move away from you.",
    "answer": "horizon"
  },
  {
    "riddle": "What always goes to bed with his shoes on?",
    "answer": "horse"
  },
  {
    "riddle": "Two bodies have I, though both joined in one. The more still I stand, the quicker I run.",
    "answer": "hourglass"
  },
  {
    "riddle": "A precious stone, as clear as diamond. Seek it out while the sun's near the horizon. Though you can walk on water with its power, try to keep it, and it'll vanish in an hour.",
    "answer": "ice"
  },
  {
    "riddle": "Power enough to smash ships and crush roofs. Yet it still must fear the sun.",
    "answer": "ice"
  },
  {
    "riddle": "Lighter than what I am made of, More of me is hidden Than is seen.",
    "answer": "iceberg"
  },
  {
    "riddle": "Glittering points that downward thrust. Sparkling spears that never rust.",
    "answer": "icicle"
  },
  {
    "riddle": "What goes in the water red, and comes out black?",
    "answer": "iron"
  },
  {
    "riddle": "I can be cracked, I can be made. I can be told, I can be played.",
    "answer": "joke"
  },
  {
    "riddle": "I turn around once. What is out will not get in. I turn around again. What is in will not get out.",
    "answer": "key"
  },
  {
    "riddle": "What goes through a door but never goes in. And never comes out?",
    "answer": "keyhole"
  },
  {
    "riddle": "Of no use to one, Bliss to two. Men lie for it. The baby’s right,",
    "answer": "kiss"
  },
  {
    "riddle": "I love to dance and twist and prance. I shake my tail, as away I sail. Wingless I fly into the sky.",
    "answer": "kite"
  },
  {
    "riddle": "Iron roof, glass walls, burns and burns and never falls.",
    "answer": "lantern"
  },
  {
    "riddle": "I am the red tongue of the earth, that buries cities.",
    "answer": "lava"
  },
  {
    "riddle": "They're up near the sky, on something very tall. Sometimes they die, only then do they fall.",
    "answer": "leaves"
  },
  {
    "riddle": "Walk on the living, they don’t even mumble. Walk on the dead, they mutter and grumble",
    "answer": "leaves"
  },
  {
    "riddle": "I do not breathe, but I run and jump. I do not eat, but I swim and stretch. I do not drink, but I sleep and stand. I do not think, but I grow and play. I do not see, but you see me everyday.",
    "answer": "leg"
  },
  {
    "riddle": "What building has the most stories?",
    "answer": "library"
  },
  {
    "riddle": "I'm sometimes white and always wrong. I can break a heart and hurt the strong. I can build love or tear it down. I can make a smile or bring a frown.",
    "answer": "lie"
  },
  {
    "riddle": "What an fill a room but takes up no space?",
    "answer": "light"
  },
  {
    "riddle": "What goes in the water black and comes out red?",
    "answer": "lobster"
  },
  {
    "riddle": "A dagger thrust at my own heart, dictates the way I'm swayed. Left I stand, and right I yield, to the twisting of the blade.",
    "answer": "lock"
  },
  {
    "riddle": "In your fire you hear me scream, creaking and whining, yet I am dead before you lay me in your hearth.",
    "answer": "log"
  },
  {
    "riddle": "What can touch someone once and last them a lifetime?",
    "answer": "love"
  },
  {
    "riddle": "I have rivers without water. Forests without trees. Mountains without rocks. Towns without houses.",
    "answer": "map"
  },
  {
    "riddle": "Tool of the thief, toy of the queen. Always used to be unseen. Sign of joy and sign of sorrow, giving all likeness borrowed.",
    "answer": "mask"
  },
  {
    "riddle": "Take one out and scratch my head, I am now black but once was red.",
    "answer": "match"
  },
  {
    "riddle": "What can bring back the dead. Make us cry, make us laugh, make us young. Born in an instant yet lasts a life time?",
    "answer": "memory"
  },
  {
    "riddle": "I'm a god. I'm a planet. I measure heat.",
    "answer": "mercury"
  },
  {
    "riddle": "You can spin, wheel and twist. But this thing can turn without moving.",
    "answer": "milk"
  },
  {
    "riddle": "Something wholly unreal, yet seems real to I. Think my friend, tell me where does it lie?",
    "answer": "mind"
  },
  {
    "riddle": "I look at you, you look at me, I raise my right, you raise your left.",
    "answer": "mirror"
  },
  {
    "riddle": "If you drop me I'm sure to crack. But give me a smile and I'll always smile back.",
    "answer": "mirror"
  },
  {
    "riddle": "Look into my face and I'm everybody. Scratch my back and I'm nobody.",
    "answer": "mirror"
  },
  {
    "riddle": "When there is fire in me then I am still cold. When I own your true love’s face then you will not see me. To all things I give no more than I am given. In time I may have all things, and yet I can keep nothing.",
    "answer": "mirror"
  },
  {
    "riddle": "A hill full, a hole full, yet you cannot catch a bowl full.",
    "answer": "mist"
  },
  {
    "riddle": "What goes further the slower it goes?",
    "answer": "money"
  },
  {
    "riddle": "Always old, sometimes new. Never sad, sometimes blue. Never empty, sometimes full. Never pushes, always pulls.",
    "answer": "moon"
  },
  {
    "riddle": "I am the hole in the night, the ever-watchful eye. I return in a cycle, to enlighten the sky.",
    "answer": "moon"
  },
  {
    "riddle": "Scythe of darkness, Shadow’s light. Guiding eye of thirteenth sight.",
    "answer": "moon"
  },
  {
    "riddle": "What has roots as nobody sees, is taller than trees. Up, up it goes, and yet never grows?",
    "answer": "mountain"
  },
  {
    "riddle": "What kind of room has no windows or doors?",
    "answer": "mushroom"
  },
  {
    "riddle": "At the sound of me, one may dream or stamp their feet, At the sound of me, one may laugh or sometimes weep.",
    "answer": "music"
  },
  {
    "riddle": "Who works when he plays and plays when he works?",
    "answer": "musician"
  },
  {
    "riddle": "I hide but my head is outside.",
    "answer": "nail"
  },
  {
    "riddle": "What is it that was given to you, belongs only to you. And yet your friends use it more than you do?",
    "answer": "name"
  },
  {
    "riddle": "An iron horse with a flaxen tail. The faster the horse runs, the shorter his tail becomes.",
    "answer": "needle"
  },
  {
    "riddle": "What has a single eye but cannot see?",
    "answer": "needle"
  },
  {
    "riddle": "What is long and slim, works in light. Has but one eye, and an awful bite?",
    "answer": "needle"
  },
  {
    "riddle": "A house of wood in a hidden place. Built without nails or glue. High above the earthen ground. It holds pale gems of blue.",
    "answer": "nest"
  },
  {
    "riddle": "Hold the tail, while I fish for you.",
    "answer": "net"
  },
  {
    "riddle": "I can be written, I can be spoken, I can be exposed, I can be broken.",
    "answer": "news"
  },
  {
    "riddle": "Sometimes I am loud. And viewed with distaste. Poke out my 'eye', then I'm on the front of your face.",
    "answer": "noise"
  },
  {
    "riddle": "What word is the same written forward, backward and upside down?",
    "answer": "noon"
  },
  {
    "riddle": "Gets rid of bad ones, short and tall. Tightens when used, one size fits all.",
    "answer": "noose"
  },
  {
    "riddle": "I can run but not walk. Wherever I go, thought follows close behind.",
    "answer": "nose"
  },
  {
    "riddle": "Two little holes in the side of a hill. Just as you come to the cherry-red mill.",
    "answer": "nose"
  },
  {
    "riddle": "It is greater than God and more evil than the devil. The poor have it, the rich need it, and if you eat it you'll die.",
    "answer": "nothing"
  },
  {
    "riddle": "What does one love more than life, fear more than death or mortal strife. What the poor have, the rich require, and what contented ones desire. What the miser spends, and the spendthrift saves. And what all carry to their graves.",
    "answer": "nothing"
  },
  {
    "riddle": "A woman went to the hardware store to buy items for her house. 1 would cost $.25. 12 would cost $.50. 122 would cost $.75. When she left the store she had spent $.75, what did she buy?",
    "answer": "numbers"
  },
  {
    "riddle": "A little house full of meat, no door to go in and eat.",
    "answer": "nut"
  },
  {
    "riddle": "I am the fountain from which no one can drink. For many, I am considered a necessary link. Like gold to all I am sought for, but my continued death brings wealth for all to want more.",
    "answer": "oil"
  },
  {
    "riddle": "Take off my skin, I won't cry, but you will.",
    "answer": "onion"
  },
  {
    "riddle": "You use a knife to slice my head. And weep beside me when I am dead.",
    "answer": "onion"
  },
  {
    "riddle": "Gold in a leather bag, swinging on a tree, money after honey in its time. Ills of a scurvy crew cured by the sea, reason in its season but no rhyme.",
    "answer": "orange"
  },
  {
    "riddle": "What asks but never answers?",
    "answer": "owl"
  },
  {
    "riddle": "It holds most knowledge that has ever been said. But is not the brain, is not the head. To feathers and their masters, it's both bane and boon. One empty, and one full.",
    "answer": "paper"
  },
  {
    "riddle": "Halfway up the hill, I see you at last, lying beneath me with your sounds and sights. A city in the twilight, dim and vast, with smoking roofs, soft bells, and gleaming lights.",
    "answer": "past"
  },
  {
    "riddle": "The eight of us move forth and back. To protect our king from the foe's attack.",
    "answer": "pawns"
  },
  {
    "riddle": "A seed am I, three letters make my name. Take away two and I still sound the same.",
    "answer": "pea"
  },
  {
    "riddle": "The strangest creature you'll ever find has two eyes in front and a hundred behind.",
    "answer": "peacock"
  },
  {
    "riddle": "A house with two occupants, sometimes one, rarely three. Break the walls, eat the boarders, then throw away me.",
    "answer": "peanut"
  },
  {
    "riddle": "Lovely and round, I shine with pale light, grown in the darkness, a lady's delight.",
    "answer": "pearl"
  },
  {
    "riddle": "I am the tool, for inspiring many. Buy me in the store, for not much more than a penny. Don't overuse me or I surely will fade. As light as a feather, yet as strong as a blade.",
    "answer": "pen"
  },
  {
    "riddle": "I usually wear a yellow coat. I usually have a dark head. I make marks wherever I go.",
    "answer": "pencil"
  },
  {
    "riddle": "What has a head, a tail, is brown, and has no legs?",
    "answer": "penny"
  },
  {
    "riddle": "I am a box that holds keys without locks, yet they can unlock your soul.",
    "answer": "piano"
  },
  {
    "riddle": "My first is twice in pepper but not once in tart. My second is in liver but not in heart. My third is in giant and also in ghost. Whole I’m best when I am roast.",
    "answer": "pig"
  },
  {
    "riddle": "What loses its head in the morning and gets it back at night?",
    "answer": "pillow"
  },
  {
    "riddle": "What makes a loud noise when changing its jacket, becomes larger but weighs less?",
    "answer": "popcorn"
  },
  {
    "riddle": "A skin have I, more eyes than one. I can be very nice when I am done.",
    "answer": "potato"
  },
  {
    "riddle": "What can be swallowed, But can also swallow you?",
    "answer": "pride"
  },
  {
    "riddle": "He has married many women but has never married.",
    "answer": "priest"
  },
  {
    "riddle": "I cannot be other than what I am, until the man who made me dies. Power and glory will fall to me finally. Only when he last closes his eyes.",
    "answer": "prince"
  },
  {
    "riddle": "Three little letters. A paradox to some. The worse that it is, the better it becomes.",
    "answer": "pun"
  },
  {
    "riddle": "Different lights do make me strange, thus into different sizes I will change.",
    "answer": "pupil"
  },
  {
    "riddle": "Only two backbones and thousands of ribs.",
    "answer": "railroad"
  },
  {
    "riddle": "I have split the one into five. I am the circle that few will spy. I am the path that breaks and gives. I am the bow no man may bend.",
    "answer": "rainbow"
  },
  {
    "riddle": "Break it and it is better, immediately set and harder to break again.",
    "answer": "record"
  },
  {
    "riddle": "You can see nothing else, When you look in my face, I will look you in the eye, And I will never lie.",
    "answer": "reflection"
  },
  {
    "riddle": "You saw me where I never was and where I could not be. And yet within that very place, my face you often see.",
    "answer": "reflection"
  },
  {
    "riddle": "What can be heard and caught but never seen?",
    "answer": "remark"
  },
  {
    "riddle": "I am never quite what I appear to be. Straight-forward I seem, but it's only skin deep. For mystery most often lies beneath my simple speech. Sharpen your wits, open your eyes, look beyond my exteriors, read me backwards, forwards, upside down. Think and answer the question...",
    "answer": "riddle"
  },
  {
    "riddle": "To unravel me you need a simple key, no key that was made by locksmith's hand. But a key that only I will understand.",
    "answer": "riddle"
  },
  {
    "riddle": "It has no top or bottom, but it can hold flesh, bones, and blood all at the same time.",
    "answer": "ring"
  },
  {
    "riddle": "What always runs but never walks, often murmurs, never talks, has a bed but never sleeps, has a mouth but never eats?",
    "answer": "river"
  },
  {
    "riddle": "I run through hills. I veer around mountains. I leap over rivers. And crawl through the forests. Step out your door to find me.",
    "answer": "road"
  },
  {
    "riddle": "Snake coiled round and round. Snake deep below the ground. Snake that's never had a head. Snake that binds but not with dread.",
    "answer": "rope"
  },
  {
    "riddle": "Ten men's strength, ten men's length. Ten men can't break it, yet a young boy walks off with it.",
    "answer": "rope"
  },
  {
    "riddle": "What can burn the eyes, sting the mouth, yet be consumed?",
    "answer": "salt"
  },
  {
    "riddle": "I build up castles. I tear down mountains. I make some men blind. I help others to see.",
    "answer": "sand"
  },
  {
    "riddle": "One by one we fall from heaven down into the depths of past, And our world is ever upturned so that yet some time we’ll last.",
    "answer": "sand"
  },
  {
    "riddle": "What measures out time. Until in time all is smashed to it?",
    "answer": "sand"
  },
  {
    "riddle": "I bind it and it walks. I loose it and it stops.",
    "answer": "sandal"
  },
  {
    "riddle": "My teeth are sharp, my back is straight, to cut things up it is my fate.",
    "answer": "saw"
  },
  {
    "riddle": "I open wide and tight I shut, Sharp am I and paper-cut fingers too, so do take care, I'm good and bad, so best beware.",
    "answer": "scissors"
  },
  {
    "riddle": "If you have it, you want to share it. If you share it, you don't have it.",
    "answer": "secret"
  },
  {
    "riddle": "By Moon or by Sun, I shall be found. Yet I am undone, if there's no light around.",
    "answer": "shadow"
  },
  {
    "riddle": "Each morning I appear to lie at your feet, all day I follow no matter how fast you run. Yet I nearly perish in the midday sun.",
    "answer": "shadow"
  },
  {
    "riddle": "I crawl on the earth. And rise on a pillar.",
    "answer": "shadow"
  },
  {
    "riddle": "Only one color, but not one size. Stuck at the bottom, yet easily flies. Present in sun, but not in rain. Doing no harm, and feeling no pain.",
    "answer": "shadow"
  },
  {
    "riddle": "Tall in the morning, short at noon, gone at night. But I'll be back soon.",
    "answer": "shadow"
  },
  {
    "riddle": "Of these things - I have two. One for me - and one for you. And when you ask about the price, I simply smile and nod twice.",
    "answer": "sharing"
  },
  {
    "riddle": "Weight in my belly, Trees on my back, I travel fast in my place, but feet is a feature I lack",
    "answer": "ship"
  },
  {
    "riddle": "Whilst I was engaged in sitting. I spied the dead carrying the living",
    "answer": "ship"
  },
  {
    "riddle": "What has a neck and no head, two arms but no hands?",
    "answer": "shirt"
  },
  {
    "riddle": "Iron on a mammal. Mammal on your feet.",
    "answer": "shoe"
  },
  {
    "riddle": "Runs over fields and woods all day. Under the bed at night sits not alone, With long tongue hanging out, Resting at your feet until we go for a walk",
    "answer": "shoe"
  },
  {
    "riddle": "What runs around all day. Then lies under the bed. With its tongue hanging out?",
    "answer": "shoe"
  },
  {
    "riddle": "In buckles or lace, they help set the pace. The farther you go, the thinner they grow.",
    "answer": "shoes"
  },
  {
    "riddle": "What five-letter word becomes shorter when you add two more letters?",
    "answer": "short"
  },
  {
    "riddle": "What is round as a dishpan, deep as a tub, and still the oceans couldn't fill it up?",
    "answer": "sieve"
  },
  {
    "riddle": "What is so fragile that saying its name breaks it?",
    "answer": "silence"
  },
  {
    "riddle": "My first is in some but not in all. My second in rise but not in fall. My third in little but not in big. My fourth in port but not in pig. My whole is made in nature's way. For clothing, rugs used every day.",
    "answer": "silk"
  },
  {
    "riddle": "Double my number, I'm less than a score. Half of my number is less than four. Add one to my double when bakers are near. Days of the week are still greater, I fear.",
    "answer": "six"
  },
  {
    "riddle": "I am whole but incomplete. I have no eyes, yet I see. You can see, and see right through me. My largest part is one fourth of what I once was.",
    "answer": "skeleton"
  },
  {
    "riddle": "Twigs and spheres and poles and plates. Join and bind to reason make.",
    "answer": "skeleton"
  },
  {
    "riddle": "When liquid splashes me, none seeps through. When I am moved a lot, liquid I spew. When I am hit, color I change. And color, I come in quite a range. What I cover is very complex, and I am very easy to flex.",
    "answer": "skin"
  },
  {
    "riddle": "I weaken all men for hours each day. I show you strange visions while you are away. I take you by night, by day take you back. None suffer to have me, but do from my lack.",
    "answer": "sleep"
  },
  {
    "riddle": "A mile from end to end, yet as close to as a friend. A precious commodity, freely given. Seen on the dead and on the living. Found on the rich, poor, short and tall, but shared among children most of all.",
    "answer": "smile"
  },
  {
    "riddle": "A house full, a yard full, a chimney full, no one can get a spoonful.",
    "answer": "smoke"
  },
  {
    "riddle": "If you carried my burden, you would break your back. I am not rich, but leave silver in my track.",
    "answer": "snail"
  },
  {
    "riddle": "Who is he that runs without a leg. And his house on his back?",
    "answer": "snail"
  },
  {
    "riddle": "I can sizzle like bacon, I am made with an egg. I have plenty of backbone but lack a good leg. I peel layers like onions, but yet remain whole. I can be long, like a flagpole, yet fit in a hole.",
    "answer": "snake"
  },
  {
    "riddle": "As beautiful as the setting sun, as delicate as the morning dew. An angel's dusting from the stars. That can turn the Earth into a frosted moon.",
    "answer": "snow"
  },
  {
    "riddle": "High born, my touch is gentle. Purest white is my lace. Silence is my kingdom. Green is the color of my death.",
    "answer": "snow"
  },
  {
    "riddle": "White bird, featherless, flying out of paradise. Flying over sea and land. Dying in my hand.",
    "answer": "snow"
  },
  {
    "riddle": "I saw a man in white, he looked quite a sight. He was not old, but he stood in the cold. And when he felt the sun, he started to run. Who could he be? Please answer me.",
    "answer": "snowman"
  },
  {
    "riddle": "They made me a mouth, but didn't give me breath. Water gives me life, but the sun brings me death.",
    "answer": "snowman"
  },
  {
    "riddle": "You use it between your head and your toes, the more it works the thinner it grows.",
    "answer": "soap"
  },
  {
    "riddle": "I cannot be felt, seen or touched. Yet I can be found in everybody. My existence is always in debate. Yet I have my own style of music.",
    "answer": "soul"
  },
  {
    "riddle": "What surrounds the world, yet dwells within a thimble?",
    "answer": "space"
  },
  {
    "riddle": "A horrid monster hides from the day, with many legs and many eyes. With silver chains it catches prey. And eats it all before it dies. Yet in every cottage does it stay. And every castle beneath the sky.",
    "answer": "spider"
  },
  {
    "riddle": "I move without wings, Between silken string, I leave as you find, My substance behind.",
    "answer": "spider"
  },
  {
    "riddle": "I went to the woods and got it, when i got it didn’t want it, looked for it, couldn’t find it so I took it home.",
    "answer": "splinter"
  },
  {
    "riddle": "I'm full of holes, yet I'm full of water.",
    "answer": "sponge"
  },
  {
    "riddle": "We travel much, yet prisoners are, and close confined to boot. Yet with any horse, we will keep the pace, and will always go on foot.",
    "answer": "spurs"
  },
  {
    "riddle": "A nut cracker up in a tree.",
    "answer": "squirrel"
  },
  {
    "riddle": "As a whole, I am both safe and secure. Behead me, I become a place of meeting. Behead me again, I am the partner of ready. Restore me, I become the domain of beasts.",
    "answer": "stable"
  },
  {
    "riddle": "What has wings, but can not fly. Is enclosed, but can outside also lie. Can open itself up, or close itself away. Is the place of kings and queens and doggerel of every means. What is it upon which I stand? Which can lead us to different lands.",
    "answer": "stage"
  },
  {
    "riddle": "Upon me you can tread, though softly under cover. And I will take you places, that you have yet to discover. I'm high, and I'm low, though flat in the middle. And though a joy to the children, adults think of me little.",
    "answer": "stairs"
  },
  {
    "riddle": "What goes around the world and stays in a corner?",
    "answer": "stamp"
  },
  {
    "riddle": "With pointed fangs it sits in wait. With piercing force it doles out fate, over bloodless victims proclaiming its might. Eternally joining in a single bite.",
    "answer": "stapler"
  },
  {
    "riddle": "At night I come without being fetched. By day I am lost without being stolen.",
    "answer": "stars"
  },
  {
    "riddle": "We are all around, yet to us you are half blind. Sunlight makes us invisible, and difficult to find.",
    "answer": "stars"
  },
  {
    "riddle": "The more you take, the more you leave behind.",
    "answer": "steps"
  },
  {
    "riddle": "Sleeping during the day, I hide away. Watchful through the night, I open at dawn's light. But only for the briefest time, do I shine. And then I hide away. And sleep through the day.",
    "answer": "sunrise"
  },
  {
    "riddle": "A dragons tooth in a mortals hand, I kill, I maim, I divide the land.",
    "answer": "sword"
  },
  {
    "riddle": "With sharp-edged wit and pointed poise. It can settle disputes without making a noise.",
    "answer": "sword"
  },
  {
    "riddle": "He has one and a person has two. A citizen has three. And a human being has four. A personality has five. And an inhabitant of earth has six.",
    "answer": "syllable"
  },
  {
    "riddle": "What starts with a 'T', ends with a 'T', and has T in it?",
    "answer": "teapot"
  },
  {
    "riddle": "Soldiers line up spaced with pride. Two long rows lined side by side. One sole unit can decide, if the rows will unite or divide.",
    "answer": "teeth"
  },
  {
    "riddle": "Thirty white horses on a red hill, First they champ, Then they stamp, Then they stand still.",
    "answer": "teeth"
  },
  {
    "riddle": "What is often returned, but never borrowed/",
    "answer": "thanks"
  },
  {
    "riddle": "What can't you see, hear, or feel, until it's too late? What shadows love, and shopkeepers hate?",
    "answer": "thief"
  },
  {
    "riddle": "An open-ended barrel, it is shaped like a hive. It is filled with the flesh, and the flesh is alive.",
    "answer": "thimble"
  },
  {
    "riddle": "He who stands beside the road; in a purple cap and tattered green robe. Those who touch him, curse him loudly. Their skin on fire, burning madly.",
    "answer": "thistle"
  },
  {
    "riddle": "I walked and walked and at last I got it. I didn't want it. So I stopped and looked for it. When I found it, I threw it away.",
    "answer": "thorn"
  },
  {
    "riddle": "Soft and fragile is my skin, I get my growth in mud. I’m dangerous as much as pretty, for if not careful, I draw blood.",
    "answer": "thorn"
  },
  {
    "riddle": "Used left or right, I get to travel over cobblestone or gravel. Used up, I vie for sweet success, used down, I cause men great duress.",
    "answer": "thumb"
  },
  {
    "riddle": "Fatherless and motherless. Born without sin, roared when it came into the world. And never spoke again.",
    "answer": "thunder"
  },
  {
    "riddle": "When the day after tomorrow is yesterday. Today will be as far from Wednesday. As today was from Wednesday. When the day before yesterday was tomorrow. What is the day after this day?",
    "answer": "thursday"
  },
  {
    "riddle": "In we go, out we go. All around and in a row. Always, always steady flow. When we'll stop, you'll never known. In we go, out we go.",
    "answer": "tides"
  },
  {
    "riddle": "There are two meanings to me. With one I may need to be broken, with the other I hold on. My favorite characteristic is my charming dimple.",
    "answer": "tie"
  },
  {
    "riddle": "Mountains will crumble and temples will fall. No one survives its endless call.",
    "answer": "time"
  },
  {
    "riddle": "This thing all things devours: Birds, beasts, trees, flowers; Gnaws iron, bites steel; Grinds hard stones to meal; Slays king, ruins town, And beats high mountains down.",
    "answer": "time"
  },
  {
    "riddle": "Until I am measured I am not known, Yet how you miss me when I have flown.",
    "answer": "time"
  },
  {
    "riddle": "What flies without wings? What passes all things? What mends all sorrow? What brings the morrow?",
    "answer": "time"
  },
  {
    "riddle": "What is it which builds things up? Lays mountains low? Dries up lakes, and makes things grow? Cares not a whim about your passing? And is like few other things, because it is everlasting?",
    "answer": "time"
  },
  {
    "riddle": "I never was, am always to be. No one ever saw me, nor ever will. And yet I am the confidence of all, To live and breath on this terrestrial ball.",
    "answer": "tomorrow"
  },
  {
    "riddle": "Forward I’m heavy, but backwards I’m not.",
    "answer": "ton"
  },
  {
    "riddle": "Often held but never touched. Always wet but never rusts. Often bites but seldom bit. To use it well you must have wit.",
    "answer": "tongue"
  },
  {
    "riddle": "What gets wetter as it dries?",
    "answer": "towel"
  },
  {
    "riddle": "Dies half its life. Lives the rest. Dances without music. Breathes without breath.",
    "answer": "tree"
  },
  {
    "riddle": "I am mother and father, but never birth or nurse. I'm rarely still, but I never wander.",
    "answer": "tree"
  },
  {
    "riddle": "Reaching stiffly for the sky, I bare my fingers when it's cold. In warmth, I wear an emerald glove and in between I dress in gold.",
    "answer": "tree"
  },
  {
    "riddle": "Some live in me, some live on. And some shave me to stride upon. I rarely leave my native land. Until my death, I always stand. High and low I may be found. Both above and below ground.",
    "answer": "tree"
  },
  {
    "riddle": "Sentinels of power, pillars of grace, Canvas of beauty, holders of strength. In the vast open, we claim our space, Our lifespans are of considerable length. We harbor life's essence, but not as you foresee, It's earth's vitality that flows in us free. What are we?",
    "answer": "trees"
  },
  {
    "riddle": "Who is it that rows quickly with four oars, but never comes out from under his roof?",
    "answer": "turtle"
  },
  {
    "riddle": "I stand slender in the dry, and open when it weeps, Under gray skies, your comfort I keep. A shield against nature, in the sunshine I sleep, Yet, in the rain my protection runs deep. What am I?",
    "answer": "umbrella"
  },
  {
    "riddle": "My thunder comes before the lightning. My lightning comes before the clouds. My rain dries all the land it touches.",
    "answer": "volcano"
  },
  {
    "riddle": "We are five little objects of an everyday sort. You will find us all in a tennis court.",
    "answer": "vowels"
  },
  {
    "riddle": "I run around the city, but I never move.",
    "answer": "wall"
  },
  {
    "riddle": "As soft as silk, as white as milk, as bitter as gall, a thick green wall, and a green coat covers me all.",
    "answer": "walnut"
  },
  {
    "riddle": "It is a part of us, and then replaced. It escapes our bodies, to a better place. The world becomes its sizeable home. Its passions unrestraint, the planet it roams.",
    "answer": "water"
  },
  {
    "riddle": "Runs smoother than any rhyme, loves to fall but cannot climb!",
    "answer": "water"
  },
  {
    "riddle": "Three lives have I. Gentle enough to soothe the skin. Light enough to caress the sky. Hard enough to crack rocks.",
    "answer": "water"
  },
  {
    "riddle": "Bright as diamonds, Loud as thunder, Never still, A thing of wonder.",
    "answer": "waterfall"
  },
  {
    "riddle": "The moon is my father. The sea is my mother. I have a million brothers. I die when I reach land.",
    "answer": "wave"
  },
  {
    "riddle": "As round as an apple. As deep as a cup. All the king's horses can't pull it up.",
    "answer": "well"
  },
  {
    "riddle": "I go around in circles, but always straight ahead. Never complain, no matter where I am led. What am I?",
    "answer": "wheel"
  },
  {
    "riddle": "All about, but cannot be seen, Can be captured, cannot be held, No throat, but can be heard.",
    "answer": "wind"
  },
  {
    "riddle": "I pass before the sun, but make no shadow.",
    "answer": "wind"
  },
  {
    "riddle": "What flies forever, Rests never?",
    "answer": "wind"
  },
  {
    "riddle": "I have four wings but cannot fly. I never laugh and never cry. On the same spot always found, toiling away with little sound.",
    "answer": "windmill"
  },
  {
    "riddle": "There is an ancient invention. Still used in some parts of the world today. That allows people to see through walls.",
    "answer": "window"
  },
  {
    "riddle": "I am the heart that does not beat. If cut, I bleed without blood. I can fly, but have no wings. I can float, but have no fins. I can sing, but have no mouth.",
    "answer": "wood"
  },
  {
    "riddle": "What is it that you must give before you can keep it.",
    "answer": "word"
  },
  {
    "riddle": "What must be in the oven yet can not be baked? Grows in the heat yet shuns the light of day? What sinks in water but rises with air? Looks like skin but is fine as hair?",
    "answer": "yeast"
  },
  {
    "riddle": "A pregnant lady named her children: Dominique, Regis, Michelle, Fawn, Sophie and Lara. What will she name her next child? Jessica, Katie, Abby or Tilly?",
    "answer": "Sound of music  Tilly. She follows the scale: Do, Re, Me, Fa, So, La, and then Ti"
  },
  {
    "riddle": "If you're paddling upstream in a canoe and a wheel falls off, how many pancakes are in the doghouse?",
    "answer": "Green, because ice cream doesn't have a cellphone! (yes, this one is meant to be ridiculous)"
  },
  {
    "riddle": "When I am young I am tall. When I am old I am short. What am I?",
    "answer": "candle"
  }
]